//
//  QuizResultView.swift
//  CAREERCOMPASS2
//
//  Created by gregorikouk.dev on 25/5/25.
//


import SwiftUI

struct QuizResultView: View {
    let type: Int

    @State var bg_color = Color("background")
    @State var dblue = Color("dblue")
    @State var lblue = Color("lblue")
    @State var llblue = Color("llblue")
    
    var body: some View {
        ZStack {
            ZStack {
                bg_color.ignoresSafeArea()
                VStack {
                    Spacer()
                    Image("vector2")
                        .resizable()
                        .frame(maxWidth: .infinity, maxHeight: 300)
                }.ignoresSafeArea()
            }
            VStack {
                HStack {
                    
                    Text("QUIZ")
                        .foregroundStyle(Color("dblue"))
                        .fontWeight(.heavy)
                        .font(.title2)
                        .padding(.vertical)
                    Spacer()
                }
                HStack {
                    Text("Συγχαρητήρια!")
                        .font(.title)
                        .foregroundStyle(dblue)
                        .bold()
                    Spacer()
                }
                HStack {
                    Text("Ολοκληρώσατε το quiz με επιτυχία.")
                        .foregroundStyle(lblue)
                        .bold()
                    Spacer()
                }
                .padding(.bottom, 20)
                switch type {
                case 0:
                    Text("""
                        🔬**Αναλυτικός Τύπος**
                        Σκέφτεστε με λογική και ακρίβεια, αγαπάτε την ανάλυση δεδομένων και την επίλυση σύνθετων προβλημάτων. 
                        Η μεθοδικότητα και η οργανωτική σας ικανότητα σας βοηθούν να ξεχωρίζετε σε επιστημονικούς και τεχνικούς τομείς.
                        
                        💡**Ιδανικοί τομείς:** Πληροφορική, Επιστήμες, Μηχανική, Μαθηματικά, Στατιστική, Έρευνα.
                        
                        📌**Συμβουλή: Επικεντρωθείτε σε καριέρες που απαιτούν κριτική σκέψη και ακρίβεια. Μη φοβάστε να δοκιμάσετε καινοτόμα projects που θα προκαλέσουν το μυαλό σας.**
                        """)
                    .foregroundStyle(dblue)
                    .padding(.bottom, 20)
      
                    
                    Text("Μπορείς να ανακαλύψεις πλέον άρθρα και πολλά σεμινάρια βασισμένα πάνω στα ενδιαφέροντα σου. Ανακάλυψε τον εαυτό σου με μερικά κλικ.")
                        .foregroundStyle(dblue)
                        .bold()
                    
                    
                case 1:
                    Text("""
                        🎨**Δημιουργικός Τύπος**
                        Έχετε έντονη φαντασία και ενθουσιασμό για καλλιτεχνική έκφραση. Σας αρέσει να καινοτομείτε και να δημιουργείτε κάτι μοναδικό. 
                        Ο χώρος των τεχνών και των μέσων είναι ο ιδανικός καμβάς για να λάμψετε.
                        
                        💡**Ιδανικοί τομείς:** Τέχνες, Design, ΜΜΕ, Μάρκετινγκ, Μουσική, Γραφιστική, Κινηματογράφος.
                        
                        📌 **Συμβουλή: Αναζητήστε ευκαιρίες για συνεργασία με άλλους δημιουργικούς και μην διστάζετε να πειραματιστείτε με νέα μέσα και τεχνολογίες.**
                        """)
                    .foregroundStyle(dblue)
                    .padding(.bottom, 20)
      
                    
                    Text("Μπορείς να ανακαλύψεις πλέον άρθρα και πολλά σεμινάρια βασισμένα πάνω στα ενδιαφέροντα σου. Ανακάλυψε τον εαυτό σου με μερικά κλικ.")
                        .foregroundStyle(dblue)
                        .bold()
                        
                    
                case 2:
                    Text("""
                        🧠**Κοινωνικός Τύπος**
                        Έχετε φυσική τάση προς την επικοινωνία και τη βοήθεια των άλλων. Αγαπάτε να στηρίζετε και να εμπνέετε τους γύρω σας. 
                        Είστε ο άνθρωπος που φέρνει αρμονία και θετική ενέργεια.
                        
                        💡**Ιδανικοί τομείς:** Ψυχολογία, Εκπαίδευση, Κοινωνικές Υπηρεσίες, Νοσηλευτική, Συμβουλευτική.
                        
                        📌**Συμβουλή: Καλλιεργήστε την ενσυναίσθηση και τη διαχείριση συγκρούσεων. Μάθετε να θέτετε όρια ώστε να διατηρείτε τη δική σας ευεξία.**
                        """)
                    .foregroundStyle(dblue)
                    .padding(.bottom, 20)
      
                    
                    Text("Μπορείς να ανακαλύψεις πλέον άρθρα και πολλά σεμινάρια βασισμένα πάνω στα ενδιαφέροντα σου. Ανακάλυψε τον εαυτό σου με μερικά κλικ.")
                        .foregroundStyle(dblue)
                        .bold()
                    
                case 3:
                    Text("""
                        🔧**Πρακτικός Τύπος**
                        Σας αρέσει να μαθαίνετε μέσα από την πράξη και να λύνετε πρακτικά προβλήματα. Έχετε τεχνική σκέψη και δίνετε έμφαση στη λειτουργικότητα. 
                        Οι μηχανικές και τεχνικές ειδικότητες σας ταιριάζουν απόλυτα.
                        
                        💡**Ιδανικοί τομείς:** Τεχνικά επαγγέλματα, Μηχανολογία, Κατασκευές, Ηλεκτρολογία, Συντήρηση.
                        
                        📌**Συμβουλή: Αναπτύξτε τις δεξιότητες χειρισμού εργαλείων και νέων τεχνολογιών. Μην αμελείτε τη θεωρία, που ενισχύει την πρακτική σας ικανότητα.**
                        """)
                    .foregroundStyle(dblue)
                    .padding(.bottom, 20)
      
                    
                    Text("Μπορείς να ανακαλύψεις πλέον άρθρα και πολλά σεμινάρια βασισμένα πάνω στα ενδιαφέροντα σου. Ανακάλυψε τον εαυτό σου με μερικά κλικ.")
                        .foregroundStyle(dblue)
                        .bold()
                    
                case 4:
                    Text("""
                        🏛️**Ηγετικός Τύπος**
                        Διαθέτετε οργανωτικό πνεύμα και ικανότητα να παίρνετε αποφάσεις. Σας αρέσει να καθοδηγείτε ομάδες και να διαμορφώνετε στρατηγικές. 
                        Η διοίκηση και η πολιτική είναι πεδία που μπορείτε να λάμψετε.
                        
                        💡**Ιδανικοί τομείς:** Διοίκηση Επιχειρήσεων, Νομικά, Οργάνωση Εκδηλώσεων, Πολιτική, Δημόσια Διοίκηση.
                        
                        📌**Συμβουλή: Ενισχύστε τις δεξιότητες επικοινωνίας και διαπραγμάτευσης. Αναζητήστε εμπειρίες ηγεσίας ακόμη και σε εθελοντικές δραστηριότητες.**
                        """)
                    .foregroundStyle(dblue)
                    .padding(.bottom, 20)
      
                    
                    Text("Μπορείς να ανακαλύψεις πλέον άρθρα και πολλά σεμινάρια βασισμένα πάνω στα ενδιαφέροντα σου. Ανακάλυψε τον εαυτό σου με μερικά κλικ.")
                        .foregroundStyle(dblue)
                        .bold()
                   
                    
                default:
                    Text("Κάτι πήγε στραβά με την αξιολόγηση. Παρακαλώ δοκιμάστε ξανά.")
                        .foregroundStyle(dblue)
                }
                
                Spacer()
            }
            .padding()
        }
    }
}

struct QuizResultView_Previews: PreviewProvider {
    static var previews: some View {
        Group {
            QuizResultView(type: 0)
                .previewDisplayName("Αρχικό Αποτέλεσμα - 0")

            QuizResultView(type: 1)
                .previewDisplayName("Λογικός")

            QuizResultView(type: 2)
                .previewDisplayName("Καλλιτεχνικός")

            QuizResultView(type: 3)
                .previewDisplayName("Κοινωνικός")

            QuizResultView(type: 4)
                .previewDisplayName("Αναλυτικός")
        }
    }
}
